### Pra-7). Write a Pandas program to implement following operation

#### to create a dataframe from a dictionary and display it

In [4]:
import pandas as pd

data = {'name': ['Mihir', 'Chintan', 'Shubham', 'Soneir', 'Hasan', 'Mumtahin'],
        'age': [21, 23, 19, 22, 25, 24],
        'city': ['Las Vegas', 'New York', 'San Francisco', 'Los Angeles', 'Chicago', 'California']}
df = pd.DataFrame(data)
df[3:6].head()

       name  age         city
3    Soneir   22  Los Angeles
4     Hasan   25      Chicago
5  Mumtahin   24   California

#### to sort the DataFrame first by 'name' in ascending order

In [6]:
sort_by_name = df.sort_values(by='name', ascending=True)
sort_by_name.head(10)

       name  age           city
1   Chintan   23       New York
4     Hasan   25        Chicago
0     Mihir   21      Las Vegas
5  Mumtahin   24     California
2   Shubham   19  San Francisco
3    Soneir   22    Los Angeles

#### to delete the one specific column from the DataFrame

In [3]:
dlt_city = df.drop(columns='city')
dlt_city.head(10)

       name  age
0     Mihir   21
1   Chintan   23
2   Shubham   19
3    Soneir   22
4     Hasan   25
5  Mumtahin   24

#### to write a DataFrame to CSV file using tab separator

In [3]:
df_csv = df.to_csv('data.csv', sep='\t') # to convert into csv

df_csv_r = pd.read_csv('Book1.csv') # to read
df_csv_r.head(10)

       name  age           city
0     Mihir   21      Las Vegas
1   Chintan   23       New York
2   Shubham    9  San Francisco
3    Soneir   22    Los Angeles
4     Hasan   25        Chicago
5  Mumtahin   24     California